artillery-chat-test.yml
config:
  target: 'http://localhost:3000' # '/chat' 경로 제거
  phases:
    - duration: 10
      arrivalRate: 1

  # Socket.IO 설정을 여기서 제거하고 processor에서 처리
# before:
#   flow:
#     - post:
#         url: users/login
#         json:
#           username: user001
#           password: password123

# payload:
#   path: './users.csv'
#   fields: [userId, loginId]

scenarios:
  - engine: socketio
    namespace: 'chat'
    flow:
      - emit:
          channel: 'joinRoom'
          data: { youtubeStreamId: 2 }

      # - loop:
      #     - count: 1
      #       steps:
      #         - function: 'generateMessage'
      #         - emit:
      #             channel: 'chat'
      #             data:
      #               youtubeStreamId: 2
      #               message: '{{ message }}'
      #         - think: 1